//
//  detailFile.swift
//  15. დავალება - Navigation
//
//  Created by gvantsa gvagvalia on 4/11/24.
//

import Foundation

struct ZodiacDetailsModel {
    
    var zodiacName: String?
    var zodiacDescription: String?
    var polarSign: String?
    var zodiacImage: String?
    
}
let zodiacInfoArray: [ZodiacDetailsModel] = [
    ZodiacDetailsModel(zodiacName: "ლომი", zodiacDescription: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც.", polarSign: "მერწყული", zodiacImage: "ლომი"),
    ZodiacDetailsModel(zodiacName: "ვერძი", zodiacDescription: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია.", polarSign: "სასწორი", zodiacImage: "ვერძი"),
    ZodiacDetailsModel(zodiacName: "კურო", zodiacDescription: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", polarSign: "მორიელი", zodiacImage: "კურო"),
    ZodiacDetailsModel(zodiacName: "ტყუპები", zodiacDescription: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", polarSign: "მშვილდოსანი", zodiacImage: "ტყუპები"),
    ZodiacDetailsModel(zodiacName: "კირჩხიბი", zodiacDescription: "ძრომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია.", polarSign: "თხის რქა", zodiacImage: "კირჩხიბი"),
    ZodiacDetailsModel(zodiacName: "ქალწული", zodiacDescription: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", polarSign: "თევზები", zodiacImage: "ქალწული"),
    ZodiacDetailsModel(zodiacName: "სასწორი", zodiacDescription: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა", polarSign: "ვერძი", zodiacImage: "სასწორი"),
    ZodiacDetailsModel(zodiacName: "მორიელი", zodiacDescription: "მიდრეკილია დაპყრობისკენ, მისი დევიზია -ყველაფერი ან არაფერი-, ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა.", polarSign: "კურო", zodiacImage: "მორიელი"),
    ZodiacDetailsModel(zodiacName: "მშვილდოსანი", zodiacDescription: "ირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", polarSign: "ტყუპები", zodiacImage: "მშვილდოსანი"),
    ZodiacDetailsModel(zodiacName: "თხის რქა", zodiacDescription:  "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა. მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები.", polarSign: "თხის რქა", zodiacImage: "თხის რქა"),
    ZodiacDetailsModel(zodiacName: "მერწყული", zodiacDescription: "მერწყული: ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას.", polarSign: "ლომი", zodiacImage: "მერწყული"),
    ZodiacDetailsModel(zodiacName: "თევზები", zodiacDescription: "თევზები: მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", polarSign: "ქალწული", zodiacImage: "თევზები"),
]

